Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/sercom.h
/* -------- SERCOM_SPIM_CTRLC : (SERCOM Offset: 0x08) (R/W 32) SPIM Control C -------- */
#define SERCOM_SPIM_CTRLC_RESETVALUE          _UINT32_(0x00)                                       /*  (SERCOM_SPIM_CTRLC) SPIM Control C  Reset Value */

#define SERCOM_SPIM_CTRLC_ICSPACE_Pos         _UINT32_(0)                                          /* (SERCOM_SPIM_CTRLC) Inter-Character Spacing Position */
#define SERCOM_SPIM_CTRLC_ICSPACE_Msk         (_UINT32_(0x3F) << SERCOM_SPIM_CTRLC_ICSPACE_Pos)    /* (SERCOM_SPIM_CTRLC) Inter-Character Spacing Mask */
#define SERCOM_SPIM_CTRLC_ICSPACE(value)      (SERCOM_SPIM_CTRLC_ICSPACE_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLC_ICSPACE_Pos)) /* Assigment of value for ICSPACE in the SERCOM_SPIM_CTRLC register */
#define SERCOM_SPIM_CTRLC_FSES_Pos            _UINT32_(8)                                          /* (SERCOM_SPIM_CTRLC) Frame Synch Edge Select Position */
#define SERCOM_SPIM_CTRLC_FSES_Msk            (_UINT32_(0x1) << SERCOM_SPIM_CTRLC_FSES_Pos)        /* (SERCOM_SPIM_CTRLC) Frame Synch Edge Select Mask */
#define SERCOM_SPIM_CTRLC_FSES(value)         (SERCOM_SPIM_CTRLC_FSES_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLC_FSES_Pos)) /* Assigment of value for FSES in the SERCOM_SPIM_CTRLC register */
#define SERCOM_SPIM_CTRLC_FSLEN_Pos           _UINT32_(9)                                          /* (SERCOM_SPIM_CTRLC) Frame Synch Length Position */
#define SERCOM_SPIM_CTRLC_FSLEN_Msk           (_UINT32_(0x1) << SERCOM_SPIM_CTRLC_FSLEN_Pos)       /* (SERCOM_SPIM_CTRLC) Frame Synch Length Mask */
#define SERCOM_SPIM_CTRLC_FSLEN(value)        (SERCOM_SPIM_CTRLC_FSLEN_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLC_FSLEN_Pos)) /* Assigment of value for FSLEN in the SERCOM_SPIM_CTRLC register */
#define   SERCOM_SPIM_CTRLC_FSLEN_STROBE_Val  _UINT32_(0x0)                                        /* (SERCOM_SPIM_CTRLC) One SCK pulse  */
#define   SERCOM_SPIM_CTRLC_FSLEN_LEVEL_Val   _UINT32_(0x1)                                        /* (SERCOM_SPIM_CTRLC) One frame duration  */
#define SERCOM_SPIM_CTRLC_FSLEN_STROBE        (SERCOM_SPIM_CTRLC_FSLEN_STROBE_Val << SERCOM_SPIM_CTRLC_FSLEN_Pos) /* (SERCOM_SPIM_CTRLC) One SCK pulse Position  */
#define SERCOM_SPIM_CTRLC_FSLEN_LEVEL         (SERCOM_SPIM_CTRLC_FSLEN_LEVEL_Val << SERCOM_SPIM_CTRLC_FSLEN_Pos) /* (SERCOM_SPIM_CTRLC) One frame duration Position  */
#define SERCOM_SPIM_CTRLC_FSPOL_Pos           _UINT32_(10)                                         /* (SERCOM_SPIM_CTRLC) Frame Synch Polarity Position */
#define SERCOM_SPIM_CTRLC_FSPOL_Msk           (_UINT32_(0x1) << SERCOM_SPIM_CTRLC_FSPOL_Pos)       /* (SERCOM_SPIM_CTRLC) Frame Synch Polarity Mask */
#define SERCOM_SPIM_CTRLC_FSPOL(value)        (SERCOM_SPIM_CTRLC_FSPOL_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLC_FSPOL_Pos)) /* Assigment of value for FSPOL in the SERCOM_SPIM_CTRLC register */
#define   SERCOM_SPIM_CTRLC_FSPOL_HIGH_Val    _UINT32_(0x0)                                        /* (SERCOM_SPIM_CTRLC) VCC-level valid polarity  */
#define   SERCOM_SPIM_CTRLC_FSPOL_LOW_Val     _UINT32_(0x1)                                        /* (SERCOM_SPIM_CTRLC) GND-level valid polarity  */
#define SERCOM_SPIM_CTRLC_FSPOL_HIGH          (SERCOM_SPIM_CTRLC_FSPOL_HIGH_Val << SERCOM_SPIM_CTRLC_FSPOL_Pos) /* (SERCOM_SPIM_CTRLC) VCC-level valid polarity Position  */
#define SERCOM_SPIM_CTRLC_FSPOL_LOW           (SERCOM_SPIM_CTRLC_FSPOL_LOW_Val << SERCOM_SPIM_CTRLC_FSPOL_Pos) /* (SERCOM_SPIM_CTRLC) GND-level valid polarity Position  */
#define SERCOM_SPIM_CTRLC_IGNTUR_Pos          _UINT32_(11)                                         /* (SERCOM_SPIM_CTRLC) Ignore Transmit Underrun Position */
#define SERCOM_SPIM_CTRLC_IGNTUR_Msk          (_UINT32_(0x1) << SERCOM_SPIM_CTRLC_IGNTUR_Pos)      /* (SERCOM_SPIM_CTRLC) Ignore Transmit Underrun Mask */
#define SERCOM_SPIM_CTRLC_IGNTUR(value)       (SERCOM_SPIM_CTRLC_IGNTUR_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLC_IGNTUR_Pos)) /* Assigment of value for IGNTUR in the SERCOM_SPIM_CTRLC register */
#define SERCOM_SPIM_CTRLC_FRMEN_Pos           _UINT32_(16)                                         /* (SERCOM_SPIM_CTRLC) Frame mode enable Position */
#define SERCOM_SPIM_CTRLC_FRMEN_Msk           (_UINT32_(0x1) << SERCOM_SPIM_CTRLC_FRMEN_Pos)       /* (SERCOM_SPIM_CTRLC) Frame mode enable Mask */
#define SERCOM_SPIM_CTRLC_FRMEN(value)        (SERCOM_SPIM_CTRLC_FRMEN_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLC_FRMEN_Pos)) /* Assigment of value for FRMEN in the SERCOM_SPIM_CTRLC register */
#define SERCOM_SPIM_CTRLC_FMODE_Pos           _UINT32_(17)                                         /* (SERCOM_SPIM_CTRLC) Frame mode Position */
#define SERCOM_SPIM_CTRLC_FMODE_Msk           (_UINT32_(0x1) << SERCOM_SPIM_CTRLC_FMODE_Pos)       /* (SERCOM_SPIM_CTRLC) Frame mode Mask */
#define SERCOM_SPIM_CTRLC_FMODE(value)        (SERCOM_SPIM_CTRLC_FMODE_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLC_FMODE_Pos)) /* Assigment of value for FMODE in the SERCOM_SPIM_CTRLC register */
#define   SERCOM_SPIM_CTRLC_FMODE_MASTER_Val  _UINT32_(0x0)                                        /* (SERCOM_SPIM_CTRLC) Frame Master  */
#define   SERCOM_SPIM_CTRLC_FMODE_SLAVE_Val   _UINT32_(0x1)                                        /* (SERCOM_SPIM_CTRLC) Frame Slave  */
#define SERCOM_SPIM_CTRLC_FMODE_MASTER        (SERCOM_SPIM_CTRLC_FMODE_MASTER_Val << SERCOM_SPIM_CTRLC_FMODE_Pos) /* (SERCOM_SPIM_CTRLC) Frame Master Position  */
#define SERCOM_SPIM_CTRLC_FMODE_SLAVE         (SERCOM_SPIM_CTRLC_FMODE_SLAVE_Val << SERCOM_SPIM_CTRLC_FMODE_Pos) /* (SERCOM_SPIM_CTRLC) Frame Slave Position  */
#define SERCOM_SPIM_CTRLC_DATA32B_Pos         _UINT32_(24)                                         /* (SERCOM_SPIM_CTRLC) Data 32 Bit Position */
#define SERCOM_SPIM_CTRLC_DATA32B_Msk         (_UINT32_(0x1) << SERCOM_SPIM_CTRLC_DATA32B_Pos)     /* (SERCOM_SPIM_CTRLC) Data 32 Bit Mask */
#define SERCOM_SPIM_CTRLC_DATA32B(value)      (SERCOM_SPIM_CTRLC_DATA32B_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLC_DATA32B_Pos)) /* Assigment of value for DATA32B in the SERCOM_SPIM_CTRLC register */
#define SERCOM_SPIM_CTRLC_FIFOEN_Pos          _UINT32_(27)                                         /* (SERCOM_SPIM_CTRLC) FIFO Enable Position */
#define SERCOM_SPIM_CTRLC_FIFOEN_Msk          (_UINT32_(0x1) << SERCOM_SPIM_CTRLC_FIFOEN_Pos)      /* (SERCOM_SPIM_CTRLC) FIFO Enable Mask */
#define SERCOM_SPIM_CTRLC_FIFOEN(value)       (SERCOM_SPIM_CTRLC_FIFOEN_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLC_FIFOEN_Pos)) /* Assigment of value for FIFOEN in the SERCOM_SPIM_CTRLC register */
#define SERCOM_SPIM_CTRLC_RXTRHOLD_Pos        _UINT32_(28)                                         /* (SERCOM_SPIM_CTRLC) Receive FIFO Threshold Position */
#define SERCOM_SPIM_CTRLC_RXTRHOLD_Msk        (_UINT32_(0x3) << SERCOM_SPIM_CTRLC_RXTRHOLD_Pos)    /* (SERCOM_SPIM_CTRLC) Receive FIFO Threshold Mask */
#define SERCOM_SPIM_CTRLC_RXTRHOLD(value)     (SERCOM_SPIM_CTRLC_RXTRHOLD_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLC_RXTRHOLD_Pos)) /* Assigment of value for RXTRHOLD in the SERCOM_SPIM_CTRLC register */
#define   SERCOM_SPIM_CTRLC_RXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_SPIM_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO  */
#define   SERCOM_SPIM_CTRLC_RXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_SPIM_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full  */
#define   SERCOM_SPIM_CTRLC_RXTRHOLD_FULL_Val _UINT32_(0x2)                                        /* (SERCOM_SPIM_CTRLC) Interrupt and DMA triggers are generated when FIFO is full  */
#define SERCOM_SPIM_CTRLC_RXTRHOLD_DEFAULT    (SERCOM_SPIM_CTRLC_RXTRHOLD_DEFAULT_Val << SERCOM_SPIM_CTRLC_RXTRHOLD_Pos) /* (SERCOM_SPIM_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO Position  */
#define SERCOM_SPIM_CTRLC_RXTRHOLD_HALF       (SERCOM_SPIM_CTRLC_RXTRHOLD_HALF_Val << SERCOM_SPIM_CTRLC_RXTRHOLD_Pos) /* (SERCOM_SPIM_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full Position  */
#define SERCOM_SPIM_CTRLC_RXTRHOLD_FULL       (SERCOM_SPIM_CTRLC_RXTRHOLD_FULL_Val << SERCOM_SPIM_CTRLC_RXTRHOLD_Pos) /* (SERCOM_SPIM_CTRLC) Interrupt and DMA triggers are generated when FIFO is full Position  */
#define SERCOM_SPIM_CTRLC_TXTRHOLD_Pos        _UINT32_(30)                                         /* (SERCOM_SPIM_CTRLC) Transmit FIFO Threshold Position */
#define SERCOM_SPIM_CTRLC_TXTRHOLD_Msk        (_UINT32_(0x3) << SERCOM_SPIM_CTRLC_TXTRHOLD_Pos)    /* (SERCOM_SPIM_CTRLC) Transmit FIFO Threshold Mask */
#define SERCOM_SPIM_CTRLC_TXTRHOLD(value)     (SERCOM_SPIM_CTRLC_TXTRHOLD_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLC_TXTRHOLD_Pos)) /* Assigment of value for TXTRHOLD in the SERCOM_SPIM_CTRLC register */
#define   SERCOM_SPIM_CTRLC_TXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_SPIM_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define   SERCOM_SPIM_CTRLC_TXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_SPIM_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free  */
#define   SERCOM_SPIM_CTRLC_TXTRHOLD_EMPTY_Val _UINT32_(0x2)                                        /* (SERCOM_SPIM_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is empty  */
#define SERCOM_SPIM_CTRLC_TXTRHOLD_DEFAULT    (SERCOM_SPIM_CTRLC_TXTRHOLD_DEFAULT_Val << SERCOM_SPIM_CTRLC_TXTRHOLD_Pos) /* (SERCOM_SPIM_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position  */
#define SERCOM_SPIM_CTRLC_TXTRHOLD_HALF       (SERCOM_SPIM_CTRLC_TXTRHOLD_HALF_Val << SERCOM_SPIM_CTRLC_TXTRHOLD_Pos) /* (SERCOM_SPIM_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free Position  */
#define SERCOM_SPIM_CTRLC_TXTRHOLD_EMPTY      (SERCOM_SPIM_CTRLC_TXTRHOLD_EMPTY_Val << SERCOM_SPIM_CTRLC_TXTRHOLD_Pos) /* (SERCOM_SPIM_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is empty Position  */
#define SERCOM_SPIM_CTRLC_Msk                 _UINT32_(0xF9030F3F)                                 /* (SERCOM_SPIM_CTRLC) Register Mask  */


/* -------- SERCOM_SPIS_CTRLC : (SERCOM Offset: 0x08) (R/W 32) SPIS Control C -------- */
#define SERCOM_SPIS_CTRLC_RESETVALUE          _UINT32_(0x00)                                       /*  (SERCOM_SPIS_CTRLC) SPIS Control C  Reset Value */

#define SERCOM_SPIS_CTRLC_ICSPACE_Pos         _UINT32_(0)                                          /* (SERCOM_SPIS_CTRLC) Inter-Character Spacing Position */
#define SERCOM_SPIS_CTRLC_ICSPACE_Msk         (_UINT32_(0x3F) << SERCOM_SPIS_CTRLC_ICSPACE_Pos)    /* (SERCOM_SPIS_CTRLC) Inter-Character Spacing Mask */
#define SERCOM_SPIS_CTRLC_ICSPACE(value)      (SERCOM_SPIS_CTRLC_ICSPACE_Msk & (_UINT32_(value) << SERCOM_SPIS_CTRLC_ICSPACE_Pos)) /* Assigment of value for ICSPACE in the SERCOM_SPIS_CTRLC register */
#define SERCOM_SPIS_CTRLC_FSES_Pos            _UINT32_(8)                                          /* (SERCOM_SPIS_CTRLC) Frame Synch Edge Select Position */
#define SERCOM_SPIS_CTRLC_FSES_Msk            (_UINT32_(0x1) << SERCOM_SPIS_CTRLC_FSES_Pos)        /* (SERCOM_SPIS_CTRLC) Frame Synch Edge Select Mask */
#define SERCOM_SPIS_CTRLC_FSES(value)         (SERCOM_SPIS_CTRLC_FSES_Msk & (_UINT32_(value) << SERCOM_SPIS_CTRLC_FSES_Pos)) /* Assigment of value for FSES in the SERCOM_SPIS_CTRLC register */
#define SERCOM_SPIS_CTRLC_FSLEN_Pos           _UINT32_(9)                                          /* (SERCOM_SPIS_CTRLC) Frame Synch Length Position */
#define SERCOM_SPIS_CTRLC_FSLEN_Msk           (_UINT32_(0x1) << SERCOM_SPIS_CTRLC_FSLEN_Pos)       /* (SERCOM_SPIS_CTRLC) Frame Synch Length Mask */
#define SERCOM_SPIS_CTRLC_FSLEN(value)        (SERCOM_SPIS_CTRLC_FSLEN_Msk & (_UINT32_(value) << SERCOM_SPIS_CTRLC_FSLEN_Pos)) /* Assigment of value for FSLEN in the SERCOM_SPIS_CTRLC register */
#define   SERCOM_SPIS_CTRLC_FSLEN_STROBE_Val  _UINT32_(0x0)                                        /* (SERCOM_SPIS_CTRLC) One SCK pulse  */
#define   SERCOM_SPIS_CTRLC_FSLEN_LEVEL_Val   _UINT32_(0x1)                                        /* (SERCOM_SPIS_CTRLC) One frame duration  */
#define SERCOM_SPIS_CTRLC_FSLEN_STROBE        (SERCOM_SPIS_CTRLC_FSLEN_STROBE_Val << SERCOM_SPIS_CTRLC_FSLEN_Pos) /* (SERCOM_SPIS_CTRLC) One SCK pulse Position  */
#define SERCOM_SPIS_CTRLC_FSLEN_LEVEL         (SERCOM_SPIS_CTRLC_FSLEN_LEVEL_Val << SERCOM_SPIS_CTRLC_FSLEN_Pos) /* (SERCOM_SPIS_CTRLC) One frame duration Position  */
#define SERCOM_SPIS_CTRLC_FSPOL_Pos           _UINT32_(10)                                         /* (SERCOM_SPIS_CTRLC) Frame Synch Polarity Position */
#define SERCOM_SPIS_CTRLC_FSPOL_Msk           (_UINT32_(0x1) << SERCOM_SPIS_CTRLC_FSPOL_Pos)       /* (SERCOM_SPIS_CTRLC) Frame Synch Polarity Mask */
#define SERCOM_SPIS_CTRLC_FSPOL(value)        (SERCOM_SPIS_CTRLC_FSPOL_Msk & (_UINT32_(value) << SERCOM_SPIS_CTRLC_FSPOL_Pos)) /* Assigment of value for FSPOL in the SERCOM_SPIS_CTRLC register */
#define   SERCOM_SPIS_CTRLC_FSPOL_HIGH_Val    _UINT32_(0x0)                                        /* (SERCOM_SPIS_CTRLC) VCC-level valid polarity  */
#define   SERCOM_SPIS_CTRLC_FSPOL_LOW_Val     _UINT32_(0x1)                                        /* (SERCOM_SPIS_CTRLC) GND-level valid polarity  */
#define SERCOM_SPIS_CTRLC_FSPOL_HIGH          (SERCOM_SPIS_CTRLC_FSPOL_HIGH_Val << SERCOM_SPIS_CTRLC_FSPOL_Pos) /* (SERCOM_SPIS_CTRLC) VCC-level valid polarity Position  */
#define SERCOM_SPIS_CTRLC_FSPOL_LOW           (SERCOM_SPIS_CTRLC_FSPOL_LOW_Val << SERCOM_SPIS_CTRLC_FSPOL_Pos) /* (SERCOM_SPIS_CTRLC) GND-level valid polarity Position  */
#define SERCOM_SPIS_CTRLC_IGNTUR_Pos          _UINT32_(11)                                         /* (SERCOM_SPIS_CTRLC) Ignore Transmit Underrun Position */
#define SERCOM_SPIS_CTRLC_IGNTUR_Msk          (_UINT32_(0x1) << SERCOM_SPIS_CTRLC_IGNTUR_Pos)      /* (SERCOM_SPIS_CTRLC) Ignore Transmit Underrun Mask */
#define SERCOM_SPIS_CTRLC_IGNTUR(value)       (SERCOM_SPIS_CTRLC_IGNTUR_Msk & (_UINT32_(value) << SERCOM_SPIS_CTRLC_IGNTUR_Pos)) /* Assigment of value for IGNTUR in the SERCOM_SPIS_CTRLC register */
#define SERCOM_SPIS_CTRLC_FRMEN_Pos           _UINT32_(16)                                         /* (SERCOM_SPIS_CTRLC) Frame mode enable Position */
#define SERCOM_SPIS_CTRLC_FRMEN_Msk           (_UINT32_(0x1) << SERCOM_SPIS_CTRLC_FRMEN_Pos)       /* (SERCOM_SPIS_CTRLC) Frame mode enable Mask */
#define SERCOM_SPIS_CTRLC_FRMEN(value)        (SERCOM_SPIS_CTRLC_FRMEN_Msk & (_UINT32_(value) << SERCOM_SPIS_CTRLC_FRMEN_Pos)) /* Assigment of value for FRMEN in the SERCOM_SPIS_CTRLC register */
#define SERCOM_SPIS_CTRLC_FMODE_Pos           _UINT32_(17)                                         /* (SERCOM_SPIS_CTRLC) Frame mode Position */
#define SERCOM_SPIS_CTRLC_FMODE_Msk           (_UINT32_(0x1) << SERCOM_SPIS_CTRLC_FMODE_Pos)       /* (SERCOM_SPIS_CTRLC) Frame mode Mask */
#define SERCOM_SPIS_CTRLC_FMODE(value)        (SERCOM_SPIS_CTRLC_FMODE_Msk & (_UINT32_(value) << SERCOM_SPIS_CTRLC_FMODE_Pos)) /* Assigment of value for FMODE in the SERCOM_SPIS_CTRLC register */
#define   SERCOM_SPIS_CTRLC_FMODE_MASTER_Val  _UINT32_(0x0)                                        /* (SERCOM_SPIS_CTRLC) Frame Master  */
#define   SERCOM_SPIS_CTRLC_FMODE_SLAVE_Val   _UINT32_(0x1)                                        /* (SERCOM_SPIS_CTRLC) Frame Slave  */
#define SERCOM_SPIS_CTRLC_FMODE_MASTER        (SERCOM_SPIS_CTRLC_FMODE_MASTER_Val << SERCOM_SPIS_CTRLC_FMODE_Pos) /* (SERCOM_SPIS_CTRLC) Frame Master Position  */
#define SERCOM_SPIS_CTRLC_FMODE_SLAVE         (SERCOM_SPIS_CTRLC_FMODE_SLAVE_Val << SERCOM_SPIS_CTRLC_FMODE_Pos) /* (SERCOM_SPIS_CTRLC) Frame Slave Position  */
#define SERCOM_SPIS_CTRLC_DATA32B_Pos         _UINT32_(24)                                         /* (SERCOM_SPIS_CTRLC) Data 32 Bit Position */
#define SERCOM_SPIS_CTRLC_DATA32B_Msk         (_UINT32_(0x1) << SERCOM_SPIS_CTRLC_DATA32B_Pos)     /* (SERCOM_SPIS_CTRLC) Data 32 Bit Mask */
#define SERCOM_SPIS_CTRLC_DATA32B(value)      (SERCOM_SPIS_CTRLC_DATA32B_Msk & (_UINT32_(value) << SERCOM_SPIS_CTRLC_DATA32B_Pos)) /* Assigment of value for DATA32B in the SERCOM_SPIS_CTRLC register */
#define SERCOM_SPIS_CTRLC_FIFOEN_Pos          _UINT32_(27)                                         /* (SERCOM_SPIS_CTRLC) FIFO Enable Position */
#define SERCOM_SPIS_CTRLC_FIFOEN_Msk          (_UINT32_(0x1) << SERCOM_SPIS_CTRLC_FIFOEN_Pos)      /* (SERCOM_SPIS_CTRLC) FIFO Enable Mask */
#define SERCOM_SPIS_CTRLC_FIFOEN(value)       (SERCOM_SPIS_CTRLC_FIFOEN_Msk & (_UINT32_(value) << SERCOM_SPIS_CTRLC_FIFOEN_Pos)) /* Assigment of value for FIFOEN in the SERCOM_SPIS_CTRLC register */
#define SERCOM_SPIS_CTRLC_RXTRHOLD_Pos        _UINT32_(28)                                         /* (SERCOM_SPIS_CTRLC) Receive FIFO Threshold Position */
#define SERCOM_SPIS_CTRLC_RXTRHOLD_Msk        (_UINT32_(0x3) << SERCOM_SPIS_CTRLC_RXTRHOLD_Pos)    /* (SERCOM_SPIS_CTRLC) Receive FIFO Threshold Mask */
#define SERCOM_SPIS_CTRLC_RXTRHOLD(value)     (SERCOM_SPIS_CTRLC_RXTRHOLD_Msk & (_UINT32_(value) << SERCOM_SPIS_CTRLC_RXTRHOLD_Pos)) /* Assigment of value for RXTRHOLD in the SERCOM_SPIS_CTRLC register */
#define   SERCOM_SPIS_CTRLC_RXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_SPIS_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO  */
#define   SERCOM_SPIS_CTRLC_RXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_SPIS_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full  */
#define   SERCOM_SPIS_CTRLC_RXTRHOLD_FULL_Val _UINT32_(0x2)                                        /* (SERCOM_SPIS_CTRLC) Interrupt and DMA triggers are generated when FIFO is full  */
#define SERCOM_SPIS_CTRLC_RXTRHOLD_DEFAULT    (SERCOM_SPIS_CTRLC_RXTRHOLD_DEFAULT_Val << SERCOM_SPIS_CTRLC_RXTRHOLD_Pos) /* (SERCOM_SPIS_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO Position  */
#define SERCOM_SPIS_CTRLC_RXTRHOLD_HALF       (SERCOM_SPIS_CTRLC_RXTRHOLD_HALF_Val << SERCOM_SPIS_CTRLC_RXTRHOLD_Pos) /* (SERCOM_SPIS_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full Position  */
#define SERCOM_SPIS_CTRLC_RXTRHOLD_FULL       (SERCOM_SPIS_CTRLC_RXTRHOLD_FULL_Val << SERCOM_SPIS_CTRLC_RXTRHOLD_Pos) /* (SERCOM_SPIS_CTRLC) Interrupt and DMA triggers are generated when FIFO is full Position  */
#define SERCOM_SPIS_CTRLC_TXTRHOLD_Pos        _UINT32_(30)                                         /* (SERCOM_SPIS_CTRLC) Transmit FIFO Threshold Position */
#define SERCOM_SPIS_CTRLC_TXTRHOLD_Msk        (_UINT32_(0x3) << SERCOM_SPIS_CTRLC_TXTRHOLD_Pos)    /* (SERCOM_SPIS_CTRLC) Transmit FIFO Threshold Mask */
#define SERCOM_SPIS_CTRLC_TXTRHOLD(value)     (SERCOM_SPIS_CTRLC_TXTRHOLD_Msk & (_UINT32_(value) << SERCOM_SPIS_CTRLC_TXTRHOLD_Pos)) /* Assigment of value for TXTRHOLD in the SERCOM_SPIS_CTRLC register */
#define   SERCOM_SPIS_CTRLC_TXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_SPIS_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define   SERCOM_SPIS_CTRLC_TXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_SPIS_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free  */
#define   SERCOM_SPIS_CTRLC_TXTRHOLD_EMPTY_Val _UINT32_(0x2)                                        /* (SERCOM_SPIS_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is empty  */
#define SERCOM_SPIS_CTRLC_TXTRHOLD_DEFAULT    (SERCOM_SPIS_CTRLC_TXTRHOLD_DEFAULT_Val << SERCOM_SPIS_CTRLC_TXTRHOLD_Pos) /* (SERCOM_SPIS_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position  */
#define SERCOM_SPIS_CTRLC_TXTRHOLD_HALF       (SERCOM_SPIS_CTRLC_TXTRHOLD_HALF_Val << SERCOM_SPIS_CTRLC_TXTRHOLD_Pos) /* (SERCOM_SPIS_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free Position  */
#define SERCOM_SPIS_CTRLC_TXTRHOLD_EMPTY      (SERCOM_SPIS_CTRLC_TXTRHOLD_EMPTY_Val << SERCOM_SPIS_CTRLC_TXTRHOLD_Pos) /* (SERCOM_SPIS_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is empty Position  */
#define SERCOM_SPIS_CTRLC_Msk                 _UINT32_(0xF9030F3F)                                 /* (SERCOM_SPIS_CTRLC) Register Mask  */


/* -------- SERCOM_USART_INT_CTRLC : (SERCOM Offset: 0x08) (R/W 32) USART Control C -------- */
#define SERCOM_USART_INT_CTRLC_RESETVALUE     _UINT32_(0x00)                                       /*  (SERCOM_USART_INT_CTRLC) USART Control C  Reset Value */

